qikaidesheng6/A102/F280049C_test/F280049C_test/project1/common/source/f28004x_epwm.c
/*
 * f28004x_epwm.c
 *
 *  Created on: 2025年8月27日
 *      Author: jzy
 */

//
// 头文件
//
#include "f28004x_device.h"
#include "f28004x_examples.h"
#include "configs.h"
#include "board.h"


// 自己添加的函数
/* --------------------------------------------------------------
 * 用户根据自己的实际需求修改
 * --------------------------------------------------------------*/


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM1GPIO(void)
 功能描述：    配置 ePWM1 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO0 和 GPIO1 作为 ePWM1 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM1 模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM1GPIO(void){

    EALLOW;   // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO0 = PUD_DISABLE;   // 禁用 GPIO0 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO1 = PUD_DISABLE;   // 禁用 GPIO1 上拉电阻

    // 配置 GPIO0 为 ePWM1A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO0 = 0;  // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO0 = 1;   // 配置为外设功能 1 (ePWM1A)

    // 配置 GPIO1 为 ePWM1B 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO1 = 0;  // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO1 = 1;   // 配置为外设功能 1 (ePWM1B)

    EDIS;   // 禁止访问受保护的寄存器
}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM2GPIO(void)
 功能描述：    配置 ePWM2 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO2 和 GPIO3 作为 ePWM2 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM2模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM2GPIO(void){

    EALLOW;   // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO2 = PUD_DISABLE;   // 禁用 GPIO2 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO3 = PUD_DISABLE;   // 禁用 GPIO3 上拉电阻

    // 配置 GPIO2 为 ePWM2A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO2 = 0;           // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO2 = 1;           // 配置为外设功能 1 (ePWM2A)

    // 配置 GPIO3 为 ePWM2B 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO3 = 0;          // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO3 = 1;           // 配置为外设功能 1 (ePWM2B)

    EDIS;    // 禁止访问受保护的寄存器
}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM3GPIO(void)
 功能描述：    配置 ePWM3 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO4 和 GPIO5 作为 ePWM3 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM3模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM3GPIO(void){

    EALLOW;  // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO4 = PUD_ENABLE;   // 禁用 GPIO4 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO5 = PUD_ENABLE;   // 禁用 GPIO5 上拉电阻

    // 配置 GPIO4 为 ePWM3A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO4 = 0;          // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO4 = 1;          // 配置为外设功能 1 (ePWM3A)

    // 配置 GPIO5 为 ePWM3A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO5 = 0;        // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO5 = 1;         // 配置为外设功能 1 (ePWM3B)

    EDIS;    // 禁止访问受保护的寄存器

}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM4GPIO(void)
 功能描述：    配置 ePWM4 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO6 和 GPIO7 作为 ePWM4 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM4模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM4GPIO(void){

    EALLOW;   // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO6 = PUD_ENABLE;   // 禁用 GPIO6 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO7 = PUD_ENABLE;   // 禁用 GPIO7 上拉电阻

    // 配置 GPIO6 为 ePWM4A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO6 = 0;// 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO6 = 1; // 配置为外设功能 1 (ePWM4A)

    // 配置 GPIO7 为 ePWM4B 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO7 = 0;// 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO7 = 1;  // 配置为外设功能 1 (ePWM4B)

    EDIS;    // 禁止访问受保护的寄存器

