qikaidesheng6/A102/F280049C_test/F280049C_test/project1/common/source/f28004x_epwm.c
}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM5GPIO(void)
 功能描述：    配置 ePWM5 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO8 和 GPIO9 作为 ePWM5 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM5模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM5GPIO(void){

    EALLOW;   // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO8 = PUD_ENABLE;   // 禁用 GPIO8 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO9 = PUD_ENABLE;   // 禁用 GPIO9 上拉电阻

    // 配置 GPIO2 为 ePWM5A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO8 = 0;         // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO8 = 1;         // 配置为外设功能 1 (ePWM5A)

    // 配置 GPIO2 为 ePWM5B 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO9 = 0;        // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO9 = 1;         // 配置为外设功能 1 (ePWM5B)

    EDIS;    // 禁止访问受保护的寄存器
}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM6GPIO(void)
 功能描述：    配置 ePWM6 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO10 和 GPIO11 作为 ePWM6 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM6模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM6GPIO(void){

    EALLOW;   // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO10 = PUD_ENABLE;   // 禁用 GPIO10 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO11 = PUD_ENABLE;  // 禁用 GPIO11 上拉电阻

    // 配置 GPIO10 为 ePWM6A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO10 = 0;        // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO10 = 1;         // 配置为外设功能 1 (ePWM6A)

    // 配置 GPIO11 为 ePWM6B 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO11 = 0;        // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO11 = 1;         // 配置为外设功能 1 (ePWM6B)

    EDIS;    // 禁止访问受保护的寄存器
}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM7GPIO(void)
 功能描述：    配置 ePWM7 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO12 和 GPIO13 作为 ePWM7 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM7模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM7GPIO(void){

    EALLOW;   // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO12 = PUD_ENABLE;   // 禁用 GPIO12 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO13 = PUD_ENABLE;   // 禁用 GPIO13 上拉电阻

    // 配置 GPIO12 为 ePWM7A 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO12 = 0;         // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO12 = 1;          // 配置为外设功能 1 (ePWM7A)

    // 配置 GPIO13 为 ePWM7B 外设功能
    GpioCtrlRegs.GPAGMUX1.bit.GPIO13 = 0;         // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO13 = 1;         // 配置为外设功能 1 (ePWM7B)

    EDIS;    // 禁止访问受保护的寄存器
}

// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM8GPIO(void)
 功能描述：    配置 ePWM8 模块对应的 GPIO 引脚功能
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：    此函数配置 GPIO14 和 GPIO15 作为 ePWM8 输出引脚
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*----------------------------------------------------------
 * 函数功能:配置 ePWM8模块的 GPIO 引脚功能
 * ----------------------------------------------------------
 * 配置步骤：
 * 1. 禁用内部上拉电阻 (GPxPUD)
 * 2. 配置多路复用器选择外设功能 (GPxGMUX, GPxMUX)
 *----------------------------------------------------------*/
void Init_ePWM8GPIO(void){

    EALLOW; // 允许访问受保护的寄存器

    // 禁用内部上拉电阻（PWM输出通常不需要上拉）
    GpioCtrlRegs.GPAPUD.bit.GPIO14 = PUD_ENABLE;   // 禁用 GPIO14 上拉电阻
    GpioCtrlRegs.GPAPUD.bit.GPIO15 = PUD_ENABLE;   // 禁用 GPIO15 上拉电阻

    GpioCtrlRegs.GPAGMUX1.bit.GPIO14 = 0;         // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO14 = 1;         // 配置为外设功能 1 (ePWM8A)

    GpioCtrlRegs.GPAGMUX1.bit.GPIO15 = 0;       // 选择功能组 0
    GpioCtrlRegs.GPAMUX1.bit.GPIO15 = 1;        // 配置为外设功能 1 (ePWM8B)

    EDIS; // 禁止访问受保护的寄存器
}



// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM1(void)
 功能描述：    配置 ePWM1 并用来产生一个 EPWMx_INT 中断 20KHz
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：   a.配置为上下计数模式，产生对称PWM波形
             b.启用死区生成，防止桥式电路直通
             c.配置事件触发用于ADC启动和中断生成
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*
 * 配置步骤：
 * ----------------------------------------------------------
 * 1、配置前停止 ePWM 外设时钟
 * 2、配置 Time-Base (TB) Submodule
 * 3、配置 Counter-Compare (CC) Submodule
 * 4、配置 Action-Qualifier (AQ) Submodule
 * 5、配置 Dead-Band Generator (DB) Submodule
 * 6、配置 Event-Trigger (ET) Submodule
 * 7、配置Digital Compare (DC) Submodule
 * 8、配置Trip-Zone (TZ) Submodule
 * ----------------------------------------------------------
 * TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1877
 *----------------------------------------------------------*/
void Init_ePWM1(void){


    EALLOW;    // 允许访问受保护的寄存器

    // 1、配置前停止 ePWM 外设时钟
    //--------------------------------------------------------------------------------------
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 0;     // 停止所有 ePWM 时基时钟同步，确保安全配置

    // 2、配置 Time-Base (TB) Submodule
    //--------------------------------------------------------------------------------------
    /*
     * 时钟计算:
     * SYSCLK = EPWMCLK = 100M
     * TBCLK = EPWMCLK / (HSPCLKDIV x CLKDIV)
     * TBCLK = 100M = 100M/1*1=100M
     *
     *TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1890
     * PWM频率计算 (上下计数模式):
     * PWM频率 = TBCLK / (2 × TBPRD)
     * 20kHz = 100MHz / (2 × TBPRD)
     * 因此 TBPRD = 2500
     */
    EPwm1Regs.TBCTL.bit.FREE_SOFT = TB_FREE;               // 仿真模式：自由运行，仿真挂起时PWM继续运行
    EPwm1Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;         // 上下计数模式
    EPwm1Regs.TBCTL.bit.PRDLD = TB_SHADOW;                 // 周期寄存器装载模式：从影子寄存器装载
    EPwm1Regs.TBCTL.bit.PHSEN = TB_PHSEN_DISABLE;          // 相位装载使能：禁用相位装载
    EPwm1Regs.TBCTL.bit.PHSDIR = TB_PHSDIR_DOWN;           // 相位方向：同步事件后向下计数
    EPwm1Regs.TBCTL.bit.HSPCLKDIV = TB_HSPCLKDIV1;         // 高速时钟预分频：1分频 (100MHz)
    EPwm1Regs.TBCTL.bit.CLKDIV = TB_CLKDIV1;               // 时基时钟预分频：1分频 (100MHz)
    EPwm1Regs.TBCTL.bit.SWFSYNC = TB_SWFSYNC_DISABLE;      // 软件强制同步：禁用
    EPwm1Regs.TBCTL.bit.SYNCOSEL = TB_CTR_ZERO;            // 同步输出选择：当计数器为零时产生同步信号


