qikaidesheng6/A102/F280049C_test/F280049C_test/project1/common/source/f28004x_epwm.c
    EPwm1Regs.TBPRD = EPWM1_TIMER_TBPRD_HALF;             // 设置 PWM 开关频率 因为是上下计数模式 所以除以 2
    EPwm1Regs.TBPHS.bit.TBPHS = 0x0000;                   // 相位寄存器清零
    EPwm1Regs.TBCTR = 0x0000;                            // 时基计数器清零



    // 3、配置 Counter-Compare (CC) Submodule 共 4 个模块
    //----------------------------------------------------------------------------------------
    EPwm1Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;          // CMPA 影子模式启用：使用影子寄存器
    //EPwm1Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;        // CMPB 影子模式启用：使用影子寄存器
    //EPwm1Regs.CMPCTL2.bit.SHDWCMODE = CC_SHADOW;       // CMPC 影子模式启用：使用影子寄存器
    //EPwm1Regs.CMPCTL2.bit.SHDWDMODE = CC_SHADOW;       // CMPD 影子模式启用：使用影子寄存器

    EPwm1Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;        // CMPA 装载时机：计数器为零时装载
    //EPwm1Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;      // CMPB 装载时机：计数器为零时装载
    //EPwm1Regs.CMPCTL2.bit.LOADCMODE = CC_CTR_ZERO;     // CMPC 装载时机：计数器为零时装载
    //EPwm1Regs.CMPCTL2.bit.LOADDMODE = CC_CTR_ZERO;     // CMPD 装载时机：计数器为零时装载

    // 注意 CMPA CMPB CMPC CMPD 之间的区别
    EPwm1Regs.CMPA.bit.CMPA = EPWM1_CMPA0;               // 设置比较器A初始值 (控制占空比)
//  EPwm1Regs.CMPB.bit.CMPB = EPWM1_CMPB0;               // 设置比较器B初始值 (控制占空比)
//  EPwm1Regs.CMPC = EPWM1_CMPC0;                       // 设置比较器C初始值 (控制占空比)
//  EPwm1Regs.CMPD = EPWM1_CMPD0;                       // 设置比较器D初始值 (控制占空比)



    // 4、配置 Action-Qualifier (AQ) Submodule
    //-----------------------------------------------------------------------------------------
    //  配置影子模式
//      EPwm1Regs.AQCTL.bit.SHDWAQAMODE = AQ_SHADOW;   // 设置AQCTLA使用影子寄存器模式
//      EPwm1Regs.AQCTL.bit.SHDWAQBMODE = AQ_SHADOW;   // 设置AQCTLB使用影子寄存器模式
//
//      EPwm1Regs.AQCTL.bit.LDAQAMODE = AQ_CTR_ZERO;   // 设置AQCTLA在计数器为零时(CTR=ZERO)加载影子寄存器
//      EPwm1Regs.AQCTL.bit.LDAQBMODE = AQ_CTR_ZERO;   // 设置AQCTLB在计数器为零时(CTR=ZERO)加载影子寄存器
//
//      EPwm1Regs.AQCTL.bit.LDAQASYNC = AQ_LOADMODE;   // 设置AQCTLA异步加载模式（仅在影子模式下有效）
//      EPwm1Regs.AQCTL.bit.LDAQBSYNC = AQ_LOADMODE;   // 设置AQCTLB异步加载模式（仅在影子模式下有效）

        // 配置立即模式 默认模式
        EPwm1Regs.AQCTL.bit.SHDWAQAMODE = AQ_IMMEDIATE;  // AQCTLA 立即模式：直接更新(无影子寄存器)
        EPwm1Regs.AQCTL.bit.SHDWAQBMODE = AQ_IMMEDIATE;  // AQCTLB 立即模式：直接更新(无影子寄存器)

       // 设置动作限定器A和B的输出动作
       //该部分可以设置为无动作，但是需要在改变占空比的中断中添加动作
       //TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1922
        EPwm1Regs.AQCTLA.bit.CAU = AQ_SET;      // 在计数器为零时设置PWM1A输出高电平
        EPwm1Regs.AQCTLA.bit.CAD = AQ_CLEAR;    // 在CAU事件（Up-count时比较器A匹配）时清除PWM1A输出
//      EPwm1Regs.AQCTLA.all = AQ_NO_ACTION;    // 禁用AQCTLA所有动作（PWM1A保持原状态）

//      EPwm1Regs.AQCTLB.bit.ZRO = AQ_SET;      // 在计数器为零时设置PWM1B输出高电平
//      EPwm1Regs.AQCTLB.bit.CBU = AQ_CLEAR;    // 在CBU事件（Up-count时比较器B匹配）时清除PWM1B输出
//      EPwm1Regs.AQCTLB.all = AQ_NO_ACTION;    // 禁用AQCTLB所有动作（PWM1B保持原状态）



    // 5、配置 Dead-Band Generator (DB) Submodule
    // TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1923
    //----------------------------------------------------------------------------------------
    // IN_MODE    S4 = 0 S5 = 0
    // OUT_MODE   S0 = 1 S1 = 1
    // POLSEL     S2 = 0 S3 = 1
    // OUTSWAP    S6 = 0 S7 = 0
    // DEDB_MODE  S8 = 0

    // 设置死区的计数器时钟
    EPwm1Regs.DBCTL.bit.HALFCYCLE = DB_Fullcycle; // 死区计数器时钟 = TBCLK =100M

    // 设置死区的输入模式
    EPwm1Regs.DBCTL.bit.IN_MODE = DBA_ALL; // 配置 EPWMxA下降沿和上升沿延迟的源

    // 设置死区的输出模式和极性
    EPwm1Regs.DBCTL.bit.OUT_MODE = DB_FULL_ENABLE; // 使能下降沿和上升沿的延迟
    EPwm1Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC;      // EPWMxB is inverted

    //
    EPwm1Regs.DBCTL.bit.OUTSWAP = OUTSWAP_INVALID;   // S6 = 0 ，S7 = 0，输出不交换
    EPwm1Regs.DBCTL.bit.DEDB_MODE = B_Mode_DISABLE;  // S8 = 0 ，下降沿和上升沿通道由 S5 S4决定，输出到A B两个信号路径。
    //EPwm1Regs.DBCTL.bit.DEDB_MODE = B_Mode_ENABLE;   // S8 = 1 ，下降沿和上升沿通道由 S4决定 ，并仅输出到B信号路径。

    // 设置死区上升沿、下降沿的延时时长
    // 实际使用示波器测量正常
    EPwm1Regs.DBRED.bit.DBRED = EPWM1_DB; //  200ns
    EPwm1Regs.DBFED.bit.DBFED = EPWM1_DB; //  200ns

    // 6、配置 Event-Trigger (ET) Submodule
    //---------------------------------------------------------------------------------------

    // =============================================
    // 配置 SOCA 触发采样  TBCTR =ZERO
    // =============================================

    EPwm1Regs.ETSEL.bit.SOCAEN = EPWMxSOC_DISABLE;   // 禁用SOCA

    EPwm1Regs.ETSEL.bit.SOCASELCMP = ET_SELCMP_AB;   // 选择比较器组
    EPwm1Regs.ETSEL.bit.SOCASEL = ET_CTR_ZERO;       // 选择具体的事件触发 ADC (即在什么时刻触发 ADC)

    EPwm1Regs.ETPS.bit.SOCPSSEL = ET_PSSEL_3;       //选择脉冲数量的低档
    EPwm1Regs.ETPS.bit.SOCAPRD = ET_1ST;           // SOCA周期：每个事件产生一个脉冲

    EPwm1Regs.ETCLR.bit.SOCA = ETCLR_CLEAR;         // 清除SOCA标志
    EPwm1Regs.ETSEL.bit.SOCAEN = EPWMxSOC_ENABLE;   // 使能 EPWMxSOCA

    // =============================================
    // 配置 SOCB 触发采样  TBCTR =TBPRD
    // =============================================
//    EPwm1Regs.ETSEL.bit.SOCBEN = EPWMxSOC_DISABLE;  // 禁用SOCB
//
//    EPwm1Regs.ETSEL.bit.SOCBSELCMP = ET_SELCMP_AB;  // 选择比较器组
//    EPwm1Regs.ETSEL.bit.SOCBSEL = ET_CTR_PRD;       // 选择具体的事件触发 ADC (即在什么时刻触发 ADC)
//
//    EPwm1Regs.ETPS.bit.SOCPSSEL = ET_PSSEL_3;       //选择脉冲数量的低档
//    EPwm1Regs.ETPS.bit.SOCBPRD = ET_1ST;           // SOCB周期：每个事件产生一个脉冲
//
//    EPwm1Regs.ETCLR.bit.SOCB = ETCLR_CLEAR;         // 清除SOCB标志
//    EPwm1Regs.ETSEL.bit.SOCBEN = EPWMxSOC_ENABLE;   // 使能 EPWMxSOCB

    // =============================================
    // 配置 INT 事件触发采样  COUNT DOWN TBCTR = CMPB
    // =============================================
//    EPwm1Regs.ETSEL.bit.INTSELCMP = ET_SELCMP_AB;   // 选择比较器组
//    EPwm1Regs.ETSEL.bit.INTSEL = ET_CTRD_CMPBD;     // 选择具体的比较器事件：即在什么时刻触发 INT 事件
//
//    EPwm1Regs.ETPS.bit.INTPSSEL = ET_PSSEL_3;       // 选择脉冲数量的低档
//    EPwm1Regs.ETPS.bit.INTPRD = ET_1ST;             // 中断周期：每个事件产生一个中断
//    // 中断配置
//    EPwm1Regs.ETSEL.bit.INTEN = EPWMxINT_ENABLE;    // 使能 EPwmx_INT generation
//    EPwm1Regs.ETCLR.bit.INT = ETCLR_CLEAR;          // 清除中断标志

    // 7、Digital Compare (DC) Submodule 数字比较子模块
    // Digital Compare (DC) Submodule
    //----------------------------------------------------------------------------------------
    // 此部分配置用于高级保护功能，如过流、过压等故障检测和保护
    // 数字比较模块可以将外部比较器(CMPSS)的输出与ePWM模块连接，实现快速硬件保护

    // 配置 TRIP4 输入源为 CMPSS1 低电平跳闸信号 (CTRIP1L)
//    EPwmXbarRegs.TRIP4MUX0TO15CFG.bit.MUX1 = EPWM_XBAR_Mux1_CMPSS1_CTRIPL; // 将TRIP4输入源设置为CMPSS1的低电平跳闸信号
//    EPwmXbarRegs.TRIP4MUXENABLE.bit.MUX1 = EPWM_XBAR_ENABLE;               // 使能TRIP4多路复用器输入

    // 配置 TRIP5 输入源为 CMPSS1 高电平跳闸信号 (CTRIP1H)
//    EPwmXbarRegs.TRIP5MUX0TO15CFG.bit.MUX0 = EPWM_XBAR_Mux0_CMPSS1_CTRIPH; // 将TRIP5输入源设置为CMPSS1的高电平跳闸信号
//    EPwmXbarRegs.TRIP5MUX0TO15CFG.bit.MUX0 = EPWM_XBAR_ENABLE;             // 使能TRIP5多路复用器输入

    // 设置数字比较(DCA)的触发源
//    EPwm1Regs.DCTRIPSEL.bit.DCAHCOMPSEL = DC_TRIPIN5;  // DCA高电平事件触发源选择TRIP5 (CMPSS1.CTRIPH)
//    EPwm1Regs.DCTRIPSEL.bit.DCALCOMPSEL = DC_TRIPIN4;  // DCA低电平事件触发源选择TRIP4 (CMPSS1.CTRIPL)

    // 设置 DCA 强制同步信号选择
//    EPwm1Regs.DCACTL.bit.EVT2FRCSYNCSEL = DC_EVT2FRCSYNCSEL_ASYNC; // EVT2不使用EPWMCLK作为强制同步信号(异步模式)
//    EPwm1Regs.DCACTL.bit.EVT1FRCSYNCSEL = DC_EVT1FRCSYNCSEL_ASYNC; // EVT1不使用EPWMCLK作为强制同步信号(异步模式)


