qikaidesheng6/A102/F280049C_test/F280049C_test/project1/common/source/f28004x_epwm.c
    // 配置DC Blanking窗口(用于过滤噪声或开关瞬态引起的误触发)
//    EPwm1Regs.DCFCTL.bit.SRCSEL = DC_SRC_DCAEVT1;     // 选择DCAEVT1作为DC Blanking窗口的输入源
//    EPwm1Regs.DCFCTL.bit.PULSESEL = DC_PULSESEL_ZERO; // 配置DC Blanking窗口的触发脉冲: 计数器为零时触发
//    EPwm1Regs.DCFOFFSET = 0;                          // 配置DC Blanking窗口的偏移量: 0个TBCLK周期
//    EPwm1Regs.DCFWINDOW = 10;                         // 配置DC Blanking窗口的大小: 10个TBCLK周期
//    EPwm1Regs.DCFCTL.bit.BLANKE = DC_BLANK_ENABLE;    // 使能DC Blanking窗口功能

     //设置 DCA 事件选择
//    EPwm1Regs.DCACTL.bit.EVT2SRCSEL = DC_EVT2; // EVT2不使用DC Blanking窗口滤波(直接使用原始信号)
//    EPwm1Regs.DCACTL.bit.EVT1SRCSEL = DC_EVT_FILT; // EVT1使用DC Blanking窗口滤波后的信号


    // 8、Trip-Zone (TZ) Submodule 跳闸子模块
    //----------------------------------------------------------------------------------------
    // 配置数字比较器事件与跳闸操作的关联

    // 配置数字比较输出A事件1(DCAEVT1)的跳闸条件
//    EPwm1Regs.TZDCSEL.bit.DCAEVT1 = TZ_DCAL_HI ;            // DCAEVT1触发条件: DCAL为高电平(DCA低电平事件)
//    EPwm1Regs.TZSEL.bit.DCAEVT1 = TZ_DCAEVT1_ENABLE;        // 使能DCAEVT1作为一次性跳闸源

    // 配置数字比较输出A事件2(DCAEVT2)的跳闸条件
//    EPwm1Regs.TZDCSEL.bit.DCAEVT2 = TZ_DCAH_HI ;            // DCAEVT2触发条件: DCAH为高电平(DCA高电平事件)
//    EPwm1Regs.TZSEL.bit.DCAEVT2 = TZ_DCAEVT2_DISABLE;       // 禁用DCAEVT2作为循环跳闸(CBC)源

    // 配置跳闸事件发生时对ePWM输出的操作
//    EPwm1Regs.TZCTL.bit.DCAEVT1 = TZ_HIZ;          // DCAEVT1发生时: 将EPWM输出设置为高阻态
//    EPwm1Regs.TZCTL.bit.DCAEVT2 = TZ_NO_CHANGE;    // DCAEVT2发生时: 不改变EPWM输出(已禁用)

    // 配置全局跳闸事件对ePWM输出的操作
//    EPwm1Regs.TZCTL.bit.TZA = TZ_FORCE_LO;   // 跳闸时强制EPWMxA输出低电平(安全状态)
//    EPwm1Regs.TZCTL.bit.TZB = TZ_FORCE_LO;   // 跳闸时强制EPWMxB输出低电平(安全状态)

    // 启动所有ePWM时基时钟同步
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 1;  // 启动所有ePWM时基时钟同步，开始PWM生成

    EDIS;     // 禁止访问受保护的寄存器
}


// =============================================================================
/*******************************************************************************
 函数名称：    void Init_ePWM2(void)
 功能描述：    配置 ePWM2
 输入参数：    无
 输出参数：    无
 返 回 值：    无
 其它说明：   a.配置为上下计数模式，产生对称PWM波形
             b.启用死区生成，防止桥式电路直通
             c.配置事件触发用于ADC启动
 修改日期      版本号          修改人            修改内容
 -----------------------------------------------------------------------------
 2025/08/27    V1.0           LW             创建
********************************************************************************/
/*
 * 配置步骤：
 * ----------------------------------------------------------
 * 1、配置前停止 ePWM 外设时钟
 * 2、配置 Time-Base (TB) Submodule
 * 3、配置 Counter-Compare (CC) Submodule
 * 4、配置 Action-Qualifier (AQ) Submodule
 * 5、配置 Dead-Band Generator (DB) Submodule
 * 6、配置 Event-Trigger (ET) Submodule
 * 7、配置Digital Compare (DC) Submodule
 * 8、配置Trip-Zone (TZ) Submodule
 * ----------------------------------------------------------
 * TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1877
 *----------------------------------------------------------*/
void Init_ePWM2(void){

    EALLOW;             // 允许访问受保护的寄存器

    // 1、配置前停止 ePWM 外设时钟
    //----------------------------------------------------------------------------
    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 0; // 停止所有 ePWM 时基时钟同步，确保安全配置

    // 2、配置 Time-Base (TB) Submodule
    //--------------------------------------------------------------------------------------
    /*
     * 时钟计算:
     * SYSCLK = EPWMCLK = 100M
     * TBCLK = EPWMCLK / (HSPCLKDIV x CLKDIV)
     * TBCLK = 100M = 100M/1*1=100M
     *
     *TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1890
     * PWM频率计算 (上下计数模式):
     * PWM频率 = TBCLK / (2 × TBPRD)
     * 20kHz = 100MHz / (2 × TBPRD)
     * 因此 TBPRD = 2500
     */

    EPwm2Regs.TBCTL.bit.FREE_SOFT = TB_FREE;               // 仿真模式：自由运行，仿真挂起时PWM继续运行
    EPwm2Regs.TBCTL.bit.CTRMODE = TB_COUNT_UPDOWN;         // 上下计数模式
    EPwm2Regs.TBCTL.bit.PRDLD = TB_SHADOW;                 // 周期寄存器装载模式：从影子寄存器装载

    // 时间基计数器同步
    /* ------------------------------------------------------
    ePWM模块能够自动同步到另一个ePWM模块的时间基。可以将超前或滞后相位控制添加到由不同的ePWM模块产生的波形中，以使其同步。
    在向上向下计数模式下，TBCTL[PSHDIR]位在同步事件后立即配置时基计数器的方向。
    新的方向与同步事件发生之前的方向无关。
    在向上计数或向下计数模式下，将忽略TBCTL[PSHDIR]位。
    * ------------------------------------------------------*/
    EPwm2Regs.TBCTL.bit.PHSEN = TB_PHSEN_ENABLE;           // 相位寄存器使能
    EPwm2Regs.TBCTL.bit.PHSDIR = TB_PHSDIR_UP;             // 相位方向：同步事件后向上计数，上下计数模式有效

    EPwm2Regs.TBCTL.bit.HSPCLKDIV = TB_HSPCLKDIV1;         // 高速时钟预分频：1分频 (100MHz)
    EPwm2Regs.TBCTL.bit.CLKDIV = TB_CLKDIV1;               // 时基时钟预分频：1分频 (100MHz)
    EPwm2Regs.TBCTL.bit.SWFSYNC = TB_SWFSYNC_DISABLE;      // 软件强制同步：禁用
    EPwm2Regs.TBCTL.bit.SYNCOSEL = TB_EPWMxSYNCI_SWFSYNC;  // 同步输出信号来源于输入的同步信号(EPWMxSYNCI)或软件强制同步(SWFSYNC)

    EPwm2Regs.TBPRD = EPWM2_TIMER_TBPRD_HALF;   // 设置 PWM 开关频率 因为是上下计数模式 所以除以 2
    EPwm2Regs.TBPHS.bit.TBPHS = 0x0002;         // 设置相位偏移计数器
    EPwm2Regs.TBCTR = 0x0000;                   // 清零时基计数器

    // 3、配置 Counter-Compare (CC) Submodule 共 4 个模块
    //----------------------------------------------------------------------------
    EPwm2Regs.CMPCTL.bit.SHDWAMODE = CC_SHADOW;         // CMPA 影子模式启用：使用影子寄存器
    //EPwm2Regs.CMPCTL.bit.SHDWBMODE = CC_SHADOW;       // CMPB 影子模式启用：使用影子寄存器
    //EPwm2Regs.CMPCTL2.bit.SHDWCMODE = CC_SHADOW;      // CMPC 影子模式启用：使用影子寄存器
    //EPwm2Regs.CMPCTL2.bit.SHDWDMODE = CC_SHADOW;      // CMPD 影子模式启用：使用影子寄存器



    EPwm2Regs.CMPCTL.bit.LOADAMODE = CC_CTR_ZERO;       // CMPA 装载时机：计数器为零时装载
    //EPwm2Regs.CMPCTL.bit.LOADBMODE = CC_CTR_ZERO;     // CMPB 装载时机：计数器为零时装载
    //EPwm2Regs.CMPCTL2.bit.LOADCMODE = CC_CTR_ZERO;    // CMPC 装载时机：计数器为零时装载
    //EPwm2Regs.CMPCTL2.bit.LOADDMODE = CC_CTR_ZERO;    // CMPD 装载时机：计数器为零时装载

    // 注意 CMPA CMPB CMPC CMPD 之间的区别
    EPwm2Regs.CMPA.bit.CMPA = EPWM2_CMPA0;               // 设置比较器A初始值 (控制占空比)
    //EPwm2Regs.CMPB.bit.CMPB = EPWM2_CMPB0;    // 设置比较器B初始值 (控制占空比)
    //EPwm2Regs.CMPC = EPWM2_CMPC0;             // 设置比较器C初始值 (控制占空比)
    //EPwm2Regs.CMPD = EPWM2_CMPD0;             // 设置比较器D初始值 (控制占空比)

    // 4、配置 Action-Qualifier (AQ) Submodule
    //----------------------------------------------------------------------------
    // 配置影子模式
//    EPwm2Regs.AQCTL.bit.SHDWAQAMODE = AQ_SHADOW;  // 设置AQCTLA使用影子寄存器模式
//    EPwm2Regs.AQCTL.bit.SHDWAQBMODE = AQ_SHADOW;  // 设置AQCTLB使用影子寄存器模式
//
//    EPwm2Regs.AQCTL.bit.LDAQAMODE = AQ_CTR_PRD;   // 设置AQCTLA在计数器为零时(CTR=TBPRD)加载影子寄存器
//    EPwm2Regs.AQCTL.bit.LDAQBMODE = AQ_CTR_PRD;   // 设置AQCTLB在计数器为零时(CTR=TBPRD)加载影子寄存器
//
//    EPwm2Regs.AQCTL.bit.LDAQASYNC = AQ_LOADMODE;  // 设置AQCTLA异步加载模式（仅在影子模式下有效）
//    EPwm2Regs.AQCTL.bit.LDAQBSYNC = AQ_LOADMODE;  // 设置AQCTLA异步加载模式（仅在影子模式下有效）

    // 配置立即模式 默认模式
    EPwm2Regs.AQCTL.bit.SHDWAQAMODE = AQ_IMMEDIATE;  // AQCTLA 立即模式：直接更新(无影子寄存器)
    EPwm2Regs.AQCTL.bit.SHDWAQBMODE = AQ_IMMEDIATE;  // AQCTLB 立即模式：直接更新(无影子寄存器)

    // 设置动作限定器A和B的输出动作
    //该部分可以设置为无动作，但是需要在改变占空比的中断中添加动作
    //只设置PWMA的动作也可以输出PWMB是因为DB子模块将PWMA反相得到PWMB
    //TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1922
    EPwm2Regs.AQCTLA.bit.CAU = AQ_SET;       // 在计数器为零时设置PWM2A输出高电平
    EPwm2Regs.AQCTLA.bit.CAD = AQ_CLEAR;     // 在CAU事件（Up-count时比较器A匹配）时清除PWM2A输出
//  EPwm2Regs.AQCTLA.all = AQ_NO_ACTION;    //禁用AQCTLB所有动作（PWM2B保持原状态）



    //EPwm2Regs.AQCTLB.bit.ZRO = AQ_SET;      // 在计数器为零时设置PWM2B输出高电平
    //EPwm2Regs.AQCTLB.bit.CBU = AQ_CLEAR;    // 在CBU事件（Up-count时比较器A匹配）时清除PWM2B输出
    //EPwm2Regs.AQCTLB.all = AQ_NO_ACTION;    //禁用AQCTLB所有动作（PWM2B保持原状态）

    // 5、配置 Dead-Band Generator (DB) Submodule
    // TI《TMS320F28004x Real-Time Microcontrollers》技术文档  page1923
    //----------------------------------------------------------------------------------------
    // IN_MODE    S4 = 0 S5 = 0
    // OUT_MODE   S0 = 1 S1 = 1
    // POLSEL     S2 = 0 S3 = 1
    // OUTSWAP    S6 = 0 S7 = 0
    // DEDB_MODE  S8 = 0

    // 设置死区的计数器时钟
    EPwm2Regs.DBCTL.bit.HALFCYCLE = DB_Fullcycle; // 死区计数器时钟 = TBCLK =100M

    // 设置死区的输入模式
    EPwm2Regs.DBCTL.bit.IN_MODE = DBA_ALL; // 配置 EPWMxA 下降沿和上升沿延迟的源

    // 设置死区的输出模式和极性
    EPwm2Regs.DBCTL.bit.OUT_MODE = DB_FULL_ENABLE; // 使能下降沿和上升沿的延迟
    EPwm2Regs.DBCTL.bit.POLSEL = DB_ACTV_HIC;      // EPWMxB is inverted

    //
    EPwm2Regs.DBCTL.bit.OUTSWAP = OUTSWAP_INVALID;   // S6 = 0 ，S7 = 0，输出不交换
    EPwm2Regs.DBCTL.bit.DEDB_MODE = B_Mode_DISABLE;  // S8 = 0 ，下降沿和上升沿通道由 S5 S4决定，输出到A B两个信号路径。
    //EPwm2Regs.DBCTL.bit.DEDB_MODE = B_Mode_ENABLE;   // S8 = 1 ，下降沿和上升沿通道由 S4决定 ，并仅输出到B信号路径。

    // 设置死区上升沿、下降沿的延时时长
    EPwm2Regs.DBRED.bit.DBRED = EPWM2_DB; // 200ns
    EPwm2Regs.DBFED.bit.DBFED = EPWM2_DB; // 200ns

    CpuSysRegs.PCLKCR0.bit.TBCLKSYNC = 1;

    EDIS;    // 禁止访问受保护的寄存器
}
